documentation/api-request.org
* Model for API Request
#+BEGIN_SRC javascript
  {
      itemType: "Bug",
      title: "AD12-105-06-01-03 - Mismatching images",
      description: "The images don't match; see attachments.",
      images: [
          {
              comment: "old slide screenshot",
              base64: "q0245jhskjnf902ihruhsiudfhsdf"
          },
          {
              comment: "new slide screenshot",
              base64: "092jnfdgjnp2lsldkmnjkn2iui24u"
          }
      ],
      action: "logdetail",
      referenceId: "AD12-105-01-03-02"
      metadata: {
          "meta1" : "hello world",
          "meta2" : "hello world"
      }
  }
#+END_SRC

* Uploading a Bug via TFS API
** Get WIT ID
*** URL variables: false
*** Endpoint URL: 
    Get the Work Item ID of the User Story we want to add the bug to.
   #+BEGIN_SRC javascript

     // TODO: FIGURE ME OUT

   #+END_SRC

** PATCH to create the bug
*** URL variables: false
*** Endpoint URL:https://utitfs.visualstudio.com/DefaultCollection/UTI-ALM/_apis/wit/workitems/$Bug?api-version=2.2
    Ensure that the request contains the information below, which is necessary to create the bug.
   #+BEGIN_SRC javascript
    [
	// Title
	{
	    "op" : "add",
	    "path": "/fields/System.Title",
	    "value": "Bug Title"
	},
	// Repro Steps
	{
	    "op" : "add",
	    "path": "/fields/Microsoft.VSTS.TCM.ReproSteps",
	    "value": "Bug Repro Steps"
	},
	// Parent Relationship
	{
	    "op": "add",
	    "path": "/relations/-",

	    "value": {
		"rel": "System.LinkTypes.Hierarchy-Reverse",
		// The URL below needs to end with the Work Item ID of
		// the User Story that the bug goes underneath
		"url": "https://utitfs.visualstudio.com/DefaultCollection/_apis/wit/workItems/790",
		"attributes": {
		    "comment": ""
		}
	    }
	},
	// -------------------------
	// DONT CHANGE ANY OF THESE
	// -------------------------
	// Area Path
	{
	    "op" : "add",
	    "path": "/fields/System.AreaPath",
	    "value": "UTI-ALM\\Courseware"
	},
	// NodeName
	{
	    "op" : "add",
	    "path": "/fields/System.NodeName",
	    "value": "Courseware"
	}
    ]
   #+END_SRC

** POST to upload attachments
*** URL variables: true
*** Endpoint URL: https://utitfs.visualstudio.com/DefaultCollection/UTI-ALM/_apis/wit/attachments/?api-version=2.2&filename=string
    #+BEGIN_SRC 

    #+END_SRC
** 4. Attach the uploaded attachment to the Work Item

 
